In [1]:
import pandas as pd

In [2]:
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [3]:
data = [(1, 2, 3, 4),
            (5, 6, 7, 8),
            (8, 10, 11, 12),
            (13, 14, 15, 16)]
df = pd.DataFrame(data = data, index = 'l1 l2 l3 l4'.split(), columns = 'c1 c2 c3 c4'.split())

In [4]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
type(df['c1'])

pandas.core.series.Series

In [7]:
df[['c3', 'c1']] # selecionando duas variáveis(colunas)

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [8]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [9]:
df[:]  # seleciona todas as linhas

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [10]:
df[1:] # seleciona da linha 1 em diante

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [11]:
df[1:3] #seleciona do indice 1 ao 3 excluindo a linha de indice 3

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [13]:
df[1:][['c3', 'c1']] # seleciona da linha indice 1 em diante apenas as colunas c3 e c1

    c3  c1
l2   7   5
l3  11   8
l4  15  13

### Método loc

In [15]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [17]:
# o método loc seleciona linha e colunas por rótulos
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [18]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [19]:
df.loc['l1', 'c2'] # esse método também nos permite selecionar o valor de uma variável em uma linha

2

In [21]:
df.loc[['l3', 'l1'], ['c3', 'c4']] # também é possível selecionar listas de linhas(registros) e colunas(variáveis)

    c3  c4
l3  11  12
l1   3   4

### Método iloc

In [20]:
# esse método nos dá a possibilidade de selecionar os registros do DataFrame de forma posicional/numerica
df.iloc[0, 1] # [linha = 0, coluna = 1]

2

In [23]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [22]:
df.iloc[[2, 0], [2, 3]] # também é possível selecionar listas de linhas(registros) e colunas(variáveis)

    c3  c4
l3  11  12
l1   3   4